app/views/posts/user_posts.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---

<% @user.posts.each do |post| %>